# Pandas

In [1]:
import  pandas as pd

# Series

In [2]:
city=pd.Series([12,25,-6,-3])

In [3]:
city

0    12
1    25
2    -6
3    -3
dtype: int64

In [4]:
city=pd.Series([12,9,8,-3],index=['day1','day2','day3','day4'])

In [5]:
city

day1    12
day2     9
day3     8
day4    -3
dtype: int64

In [6]:
city['day1']

12

In [7]:
city[city>6]

day1    12
day2     9
day3     8
dtype: int64

In [8]:
city[city<5]

day4   -3
dtype: int64

In [9]:
city['day5']=20

In [10]:
city

day1    12
day2     9
day3     8
day4    -3
day5    20
dtype: int64

In [11]:
city>6

day1     True
day2     True
day3     True
day4    False
day5     True
dtype: bool

In [12]:
city[(city >5) & (city<10)]

day2    9
day3    8
dtype: int64

In [13]:
       city.max()

20

In [14]:
city.min()

-3

In [15]:
city[(city<5)|(city>10)]

day1    12
day4    -3
day5    20
dtype: int64

In [16]:
city+2

day1    14
day2    11
day3    10
day4    -1
day5    22
dtype: int64

In [17]:
data={'Kerala':28,'AP':32,'TN':34,'Delhi':23}

In [18]:
pd.Series(data)

Kerala    28
AP        32
TN        34
Delhi     23
dtype: int64

In [19]:
states=['Andhra','Delhi','Kerala','TN','UP']

In [20]:
temperature=pd.Series(data,index=states)

In [21]:
temperature

Andhra     NaN
Delhi     23.0
Kerala    28.0
TN        34.0
UP         NaN
dtype: float64

In [22]:
temperature.isna()

Andhra     True
Delhi     False
Kerala    False
TN        False
UP         True
dtype: bool

In [23]:
temperature[temperature.isna()]

Andhra   NaN
UP       NaN
dtype: float64

In [24]:
temperature['Andhra']=20

In [25]:
temperature

Andhra    20.0
Delhi     23.0
Kerala    28.0
TN        34.0
UP         NaN
dtype: float64

In [26]:
temperature['UP']=30

In [27]:
temperature

Andhra    20.0
Delhi     23.0
Kerala    28.0
TN        34.0
UP        30.0
dtype: float64

# Data Frame

In [28]:
data={'states':['Kerala','Tn','AP','Karnataka'],'male_pop':[300,250,280,300],'female_pop':[290,300,250,320]}

In [29]:
df=pd.DataFrame(data)

In [30]:
df

      states  male_pop  female_pop
0     Kerala       300         290
1         Tn       250         300
2         AP       280         250
3  Karnataka       300         320

In [31]:
df['tot_pop']=df['male_pop']+df['female_pop']

In [32]:
df

      states  male_pop  female_pop  tot_pop
0     Kerala       300         290      590
1         Tn       250         300      550
2         AP       280         250      530
3  Karnataka       300         320      620

In [33]:
df['income']=[100,200,300,400]

In [34]:
df

      states  male_pop  female_pop  tot_pop  income
0     Kerala       300         290      590     100
1         Tn       250         300      550     200
2         AP       280         250      530     300
3  Karnataka       300         320      620     400

In [35]:
del df['male_pop']

In [36]:
df

      states  female_pop  tot_pop  income
0     Kerala         290      590     100
1         Tn         300      550     200
2         AP         250      530     300
3  Karnataka         320      620     400

In [38]:
df = df.drop('female_pop',axis = 1)

KeyError: "['female_pop'] not found in axis"

In [39]:
df

      states  tot_pop  income
0     Kerala      590     100
1         Tn      550     200
2         AP      530     300
3  Karnataka      620     400

In [44]:
data=pd.read_csv('C:/Users/User/Downloads/auto-mpg (2).csv')

In [45]:
data

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [46]:
data.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [48]:
data.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [50]:
data.shape

(398, 9)

In [51]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    int64
 8   car name      398 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

In [53]:
data.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower       object
weight            int64
acceleration    float64
model year        int64
origin            int64
car name         object
dtype: object

In [56]:
data.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model year', 'origin', 'car name'],
      dtype='object')

In [58]:
data.isna().sum()

mpg             0
cylinders       0
displacement    0
horsepower      0
weight          0
acceleration    0
model year      0
origin          0
car name        0
dtype: int64

In [59]:
data['car name'].nunique()

305

In [60]:
data['origin'].unique()

array([1, 3, 2], dtype=int64)

In [61]:
data['origin'].value_counts()

origin
1    249
3     79
2     70
Name: count, dtype: int64

In [66]:
data.isnull().sum()

mpg             0
cylinders       0
displacement    0
horsepower      0
weight          0
acceleration    0
model year      0
origin          0
car name        0
dtype: int64

In [68]:
data['mpg'].max()

46.6

In [70]:
data[data['mpg']==data['mpg'].max()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
322,46.6,4,86.0,65,2110,17.9,80,3,mazda glc

In [71]:
data[data['acceleration']==data['acceleration'].max()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
299,27.2,4,141.0,71,3190,24.8,79,2,peugeot 504